.cf.xml/InformationRegisters/обм_Приемники_ЗагруженныеПакетыДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>обм_Приемники_ЗагруженныеПакетыДанных</Name>
			<Comment>Хранит связь между ссылкой приемника и объектом входящего запроса, откуда были взяты данные для заполения приемника</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПакетДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.обм_ПакетыДанных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Данные_sha256</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.общ_sha256</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Данные_Длина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбработчикПакетаДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.общ_Обработчики</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Приемник</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

.cf.xml/Catalogs/обм_ПакетыДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>обм_ПакетыДанных</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.обм_ВходящиеСообщения</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Узел</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_узел</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_категория</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_ид</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Данные_sha256</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.общ_sha256</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Данные_Длина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.общ_Обработчики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

.cf.xml/InformationRegisters/обм_Приемники_ЗагруженныеПакетыДанных/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура Связать(пПриемник, пПакетДанных, пОбработчикЗагрузкиДанныхЗаполнения) Экспорт
	
	// Для контекстной подсказки
	Если Ложь Тогда
		пПакетДанных = Справочники.обм_ПакетыДанных.ПустаяСсылка();
		
	КонецЕсли;
	
	обработчикСсылка = Справочники.общ_Обработчики.НайтиСсылку(пОбработчикЗагрузкиДанныхЗаполнения);
	Если Не общ.ЭтоЗаполненнаяСсылка(обработчикСсылка, Тип("СправочникСсылка.общ_Обработчики")) Тогда
		Возврат;
		
	КонецЕсли;

	Если Не общ.ЭтоЗаполненнаяСсылка(пПриемник) Тогда
		Возврат;
		
	КонецЕсли; 
	
	Если Не общ.ЭтоЗаполненнаяСсылка(пПакетДанных, Тип("СправочникСсылка.обм_ПакетыДанных")) Или Не общ.Ссылка_Существует(пПакетДанных) Тогда
		Возврат;
		
	КонецЕсли;
	
	// Зафиксировать заполненного приемника в регистре
		// Получить последние данные
		запрос = Новый Запрос;
		запрос.УстановитьПараметр("пПриемник", пПриемник);
		запрос.УстановитьПараметр("пПакетДанных", пПакетДанных);
		запрос.УстановитьПараметр("обработчикСсылка", обработчикСсылка);
		запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПД.Ссылка КАК Ссылка,
		|	ПД.ДатаВремя КАК ДатаВремя,
		|	ПД.Данные_sha256 КАК Данные_sha256,
		|	ПД.Данные_Длина КАК Данные_Длина
		|ПОМЕСТИТЬ пакетДанных
		|ИЗ
		|	Справочник.обм_ПакетыДанных КАК ПД
		|ГДЕ
		|	ПД.Ссылка = &пПакетДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА СвязьПП.Приемник ЕСТЬ НЕ NULL 
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ДанныеИзменены,
		|	пд.Ссылка КАК ПакетДанных,
		|	пд.ДатаВремя КАК ДатаВремя,
		|	пд.Данные_sha256 КАК Данные_sha256,
		|	пд.Данные_Длина КАК Данные_Длина
		|ИЗ
		|	пакетДанных КАК пд
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.обм_Приемники_ЗагруженныеПакетыДанных.СрезПоследних(, Приемник = &пПриемник) КАК СвязьПП
		|		ПО (СвязьПП.ОбработчикПакетаДанных <> &обработчикСсылка
		|				ИЛИ СвязьПП.ПакетДанных <> пд.Ссылка
		|				ИЛИ СвязьПП.ДатаВремя <> пд.ДатаВремя
		|				ИЛИ СвязьПП.Данные_sha256 <> пд.Данные_sha256
		|				ИЛИ СвязьПП.Данные_Длина <> пд.Данные_Длина)";
		выборка = запрос.Выполнить().Выбрать();
		
		Если Не выборка.Следующий() Тогда 
			Возврат;
			
		КонецЕсли;
		
		Если Не выборка.ДанныеИзменены Тогда
			Возврат;
			
		КонецЕсли;
		
		запись = РегистрыСведений.обм_Приемники_ЗагруженныеПакетыДанных.СоздатьМенеджерЗаписи();
		запись.Период = общ.ДатаУниверсальная();
		запись.Приемник = пПриемник;
		запись.ПакетДанных = пПакетДанных;
		запись.ДатаВремя = выборка.ДатаВремя;
		запись.Данные_sha256 = выборка.Данные_sha256;
		запись.Данные_Длина = выборка.Данные_Длина; 
		запись.ОбработчикПакетаДанных = обработчикСсылка;
		запись.Записать(); 
	
КонецПроцедуры
	
#КонецЕсли // #Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
